<?php
die('5');
//$N=long
//$E=lat
function coordinate($code) {
    switch ($code) {

        case 631 :
            $city = "آبادان";
            $N = 48.30;
            $E = 30.30;
            break;
//--------------
        case 0282282 :
            $city = "آبيک";
            $N = 50.31;
            $E = 36.3;
            break;
//--------------
        case 121 :
            $city = "آمل";
            $N = 52.24;
            $E = 36.26;
            break;
//--------------
        case 861 :
            $city = "اراک";
            $N = 49.41;
            $E = 34.6;
            break;
//--------------
        case 451 :
            $city = "اردبيل";
            $N = 48.17;
            $E = 38.15;
            break;
//--------------
        case 441 :
            $city = "اروميه";
            $N = 44.58;
            $E = 37.34;
            break;
//--------------
        case 0 :
            $city = "اسلام شهر";
            $N = 51.12;
            $E = 35.33;
            break;
//--------------
        case 0 :
            $city = "اهواز";
            $N = 48.49;
            $E = 31.24;
            break;
//--------------
        case 0 :
            $city = "بابل ";
            $N = 52.42;
            $E = 36.33;
            break;
//--------------
        case 584 :
            $city = "بجنورد";
            $N = 57.18;
            $E = 37.27;
            break;
//--------------
        case 0 :
            $city = "بندر ترکمن";
            $N = 54.3;
            $E = 36.53;
            break;
//--------------
        case 0 :
            $city = "بندرعباس";
            $N = 56.26;
            $E = 27.17;
            break;
//--------------
        case 0 :
            $city = "بهشر";
            $N = 53.33;
            $E = 36.43;
            break;
//--------------
        case 0 :
            $city = "تاکستان";
            $N = 49.41;
            $E = 36.4;
            break;
//--------------
        case 0 :
            $city = "تبريز";
            $N = 46.26;
            $E = 38.6;
            break;
//--------------
        case 0 :
            $city = "تربت حيدريه";
            $N = 59.12;
            $E = 35.17;
            break;
//--------------
        case 0 :
            $city = "تهران";
            $N = 51.40;
            $E = 35.70;
            break;
//--------------
        case 0 :
            $city = "تهران";
            $N = 51.26;
            $E = 35.40;
            break;
//--------------
        case 0 :
            $city = "چالوس";
            $N = 51.23;
            $E = 36.40;
            break;
//--------------
        case 0 :
            $city = "چناران";
            $N = 59.5;
            $E = 36.39;
            break;
//--------------
        case 0 :
            $city = "دامغان";
            $N = 54.20;
            $E = 36.10;
            break;
//--------------
        case 0 :
            $city = "دزفول";
            $N = 48.27;
            $E = 32.23;
            break;
//--------------
        case 0 :
            $city = "دماوند";
            $N = 52.4;
            $E = 35.43;
            break;
//--------------
        case 0 :
            $city = "رامسر";
            $N = 50.41;
            $E = 36.54;
            break;
//--------------
        case 0 :
            $city = "رباط کريم";
            $N = 51.4;
            $E = 35.28;
            break;
//--------------
        case 0 :
            $city = "رشت";
            $N = 49.36;
            $E = 37.18;
            break;
//--------------
        case 0 :
            $city = "زنجان";
            $N = 48.31;
            $E = 36.40;
            break;
//--------------
        case 0 :
            $city = "ساري";
            $N = 53.6;
            $E = 36.33;
            break;
//--------------
        case 0 :
            $city = "ساوه";
            $N = 50.19;
            $E = 35.10;
            break;
//--------------
        case 0 :
            $city = "سبزوار";
            $N = 57.37;
            $E = 36.13;
            break;
//--------------
        case 0 :
            $city = "سمنان";
            $N = 53.22;
            $E = 35.33;
            break;
//--------------
        case 0 :
            $city = "سنندج";
            $N = 47.6;
            $E = 35.18;
            break;
//--------------
        case 0 :
            $city = "شاهرود";
            $N = 54.57;
            $E = 36.25;
            break;
//--------------
        case 0 :
            $city = "شهريار";
            $N = 51.3;
            $E = 35.39;
            break;
//--------------
        case 0 :
            $city = "شيراز";
            $N = 52.35;
            $E = 29.39;
            break;
//--------------
        case 0 :
            $city = "شيراز";
            $N = 52.34;
            $E = 29.38;
            break;
//--------------
        case 0 :
            $city = "شيروان";
            $N = 57.54;
            $E = 37.27;
            break;
//--------------
        case 0 :
            $city = "علي آباد";
            $N = 54.51;
            $E = 36.54;
            break;
//--------------
        case 0 :
            $city = "قرچک";
            $N = 51.34;
            $E = 35.25;
            break;
//--------------
        case 0 :
            $city = "قزوين";
            $N = 50.1;
            $E = 36.15;
            break;
//--------------
        case 0 :
            $city = "قم";
            $N = 50.56;
            $E = 34.49;
            break;
//--------------
        case 0 :
            $city = "قوچان";
            $N = 58.28;
            $E = 37.7;
            break;
//--------------
        case 0 :
            $city = "گرمسار";
            $N = 52.19;
            $E = 35.13;
            break;
//--------------
        case 0 :
            $city = "گنبد قابوس";
            $N = 55.9;
            $E = 37.15;
            break;
//--------------
        case 0 :
            $city = "لنگرود";
            $N = 50.8;
            $E = 37.11;
            break;
//--------------
        case 511 :
            $city = "مشهد";
            $N = 59.37;
            $E = 36.16;
            break;
//--------------
        case 0 :
            $city = "ملارد";
            $N = 50.59;
            $E = 35.40;
            break;
//--------------
        case 0 :
            $city = "نيشاپور";
            $N = 58.49;
            $E = 36.13;
            break;
//--------------
        case 0 :
            $city = "نکاه";
            $N = 53.17;
            $E = 36.40;
            break;
//--------------
        case 0 :
            $city = "هشتگرد";
            $N = 50.39;
            $E = 35.85;
            break;
//--------------
        case 0 :
            $city = "همدان";
            $N = 48.34;
            $E = 36.46;
            break;
//--------------
        case 0 :
            $city = "ورامين";
            $N = 51.39;
            $E = 35.19;
            break;
//--------------
        case 0 :
            $city = "يزد";
            $N = 54.40;
            $E = 32.0;
            break;
//--------------
        case 0 :
            $city = "کاشمر";
            $N = 58.31;
            $E = 35.11;
            break;
//--------------
        case 0261 :
            $city = "کرج";
            $N = 50.57;
            $E = 35.48;
            break;
//--------------
        case 0 :
            $city = "کرمان";
            $N = 57.10;
            $E = 30.30;
            break;
//--------------
        case 0 :
            $city = "کرمانشاه";
            $N = 47.3;
            $E = 34.23;
            break;
//--------------
        case 764442 :
            $city = "كيش";
            $N = 53.98;
            $E = 26.53;
            break;
//--------------
        default:
            $city = "نامشخص";
            $N = 0;
            $E = 0;
    }
    $NEC[0] = $N;
    $NEC[1] = $E;
    $NEC[2] = $city;
    return $NEC;
}
?> 